[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:13:23
     const columns = [
         {
             Header: 'Cow Price',
-            accessor: 'cowPrice', 
+            accessor: "", 
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-cowPrice"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:48:9
                   },
 
         },
-        {
-            Header: 'Leaderboard',
-            id: 'showLeaderboard',
-            accessor: (row, _rowIndex) => String(row.showLeaderboard), // hack needed for boolean values to show up
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
-        },
+        {},
         {
             Header: 'Capacity',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!
