[Killed] StringLiteral
main/components/Commons/CommonsForm.js:28:18
     const {data: healthUpdateStrategies} = useBackend(
         "/api/commons/all-health-update-strategies", {
             method: "GET",
-            url: "/api/commons/all-health-update-strategies",
+            url: "",
         },
     );
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="aboveCapacityHealthUpdateStrategy-Noop"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:36:25
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const DefaultVals = {
-        name: "", startingBalance: "10000", cowPrice: "100",
-        milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today
-    };
+    const DefaultVals = {};
 
     const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:37:15
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
     const DefaultVals = {
-        name: "", startingBalance: "10000", cowPrice: "100",
+        name: "Stryker was here!", startingBalance: "10000", cowPrice: "100",
         milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today
     };
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: Commons name is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:37:36
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
     const DefaultVals = {
-        name: "", startingBalance: "10000", cowPrice: "100",
+        name: "", startingBalance: "", cowPrice: "100",
         milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today
     };
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(10000)

Expected the element to have value:
  10000
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:41:27
         milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today
     };
 
-    const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+    const belowStrategy = false;
     const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:41:27
         milkPrice: "1", degradationRate: 0.001, carryingCapacity: 100, startingDate: today
     };
 
-    const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+    const belowStrategy = initialCommons?.belowCapacityStrategy && healthUpdateStrategies?.defaultBelowCapacity;
     const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:42:27
     };
 
     const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
-    const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
+    const aboveStrategy = initialCommons.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
     return (
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'aboveCapacityStrategy')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:42:27
     };
 
     const belowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
-    const aboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
+    const aboveStrategy = false;
 
     return (
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:46:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialCommons && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={`${testid}-id`}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialCommons.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <div className="border-bottom mb-3"></div>
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Error: Unable to find an element with the text: /Id/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:62:64
 
             <div className="border-bottom mb-3"></div>
 
-            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r0`}>
+            <Row className="flex justify-content-start" style={{}} data-testid={`${testid}-r0`}>
                 <Col className="" md={6}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:100:46
                                 step="0.01"
                                 defaultValue={DefaultVals.startingBalance}
                                 isInvalid={!!errors.startingBalance}
-                                {...register("startingBalance", {
+                                {...register("", {
                                     valueAsNumber: true,
                                     required: "Starting Balance is required",
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:130:46
                                 step="0.01"
                                 defaultValue={DefaultVals.cowPrice}
                                 isInvalid={!!errors.cowPrice}
-                                {...register("cowPrice", {
+                                {...register("", {
                                     valueAsNumber: true,
                                     required: "Cow price is required",
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:154:46
                             delay='100'
                         >
                             <Form.Control
-                                data-testid={`${testid}-milkPrice`}
+                                data-testid={``}
                                 id="milkPrice"
                                 type="number"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-milkPrice"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:160:59
                                 step="0.01"
                                 defaultValue={DefaultVals.milkPrice}
                                 isInvalid={!!errors.milkPrice}
-                                {...register("milkPrice", {
-                                    valueAsNumber: true,
-                                    required: "Milk price is required",
-                                    min: {value: 0.01, message: "Milk price must be ≥ 0.01"},
-                                })}
+                                {...register("milkPrice", {})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Milk price is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:193:46
                                 defaultValue={DefaultVals.degradationRate}
 
                                 isInvalid={!!errors.degradationRate}
-                                {...register("degradationRate", {
+                                {...register("", {
                                     valueAsNumber: true,
                                     required: "Degradation rate is required",
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:196:62
                                 {...register("degradationRate", {
                                     valueAsNumber: true,
                                     required: "Degradation rate is required",
-                                    min: {value: 0, message: "Degradation rate must be ≥ 0"},
+                                    min: {value: 0, message: ""},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Degradation rate must be ≥ 0/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:246:44
                                 id="capacityPerUser"
                                 type="number"
                                 step="1"
-                                isInvalid={!!errors.capacityPerUser}
+                                isInvalid={!errors.capacityPerUser}
                                 {...register("capacityPerUser", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:249:47
                                 isInvalid={!!errors.capacityPerUser}
                                 {...register("capacityPerUser", {
                                     valueAsNumber: true,
-                                    required: "Capacity Per User is required",
+                                    required: "",
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Capacity Per User is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:261:57
             </Row>
 
 
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+            <Form.Group className="mb-5" style={{width: "", height: '50px'}} data-testid={`${testid}-r3`}>
                 <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:303:35
                 </Col>
                 <Col md={6}>
                     <HealthUpdateStrategiesDropdown
-                        formName={"belowCapacityHealthUpdateStrategy"}
+                        formName={""}
                         displayName={"When below capacity"}
                         initialValue={belowStrategy}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:323:38
                         data-testid={`${testid}-showLeaderboard`}
                         type="checkbox"
                         id="showLeaderboard"
-                        {...register("showLeaderboard")}
+                        {...register("")}
                     />
                 </OverlayTrigger>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
