[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:13:9
     });
 
     const columns = [
-        {
-            Header: 'User Id',
-            accessor: 'userId',
-        },
+        {},
         {
             Header: 'Username',
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:14:21
 
     const columns = [
         {
-            Header: 'User Id',
+            Header: "",
             accessor: 'userId',
         },
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: User Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; ma

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:21:9
             Header: 'Username',
             accessor: 'username', 
         },
-        {
-            Header: 'Total Wealth',
-            id: 'totalWealth',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.totalWealth);
-            },
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
-        },
+        {},
         {
             Header: 'Cows Owned',
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:22:21
             accessor: 'username', 
         },
         {
-            Header: 'Total Wealth',
+            Header: "",
             id: 'totalWealth',
             accessor: (row, _rowIndex) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Total Wealth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: bloc

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:24:43
         {
             Header: 'Total Wealth',
             id: 'totalWealth',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.totalWealth);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $1,000.00
Received:

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:32:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
                   },
         },
-        {
-            Header: 'Cows Owned',
-            accessor: 'numOfCows', 
-        },
+        {},
         {
             Header: 'Cow Health',
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:40:9
             Header: 'Cow Health',
             accessor: 'cowHealth', 
         },
-        {
-            Header: 'Cows Bought',
-            accessor: 'cowsBought', 
-        },
+        {},
         {
             Header: 'Cows Sold',
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:45:21
             accessor: 'cowsBought', 
         },
         {
-            Header: 'Cows Sold',
+            Header: "",
             accessor: 'cowsSold',
         },
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cows Sold. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:49:21
             accessor: 'cowsSold',
         },
         {
-            Header: 'Cow Deaths',
+            Header: "",
             accessor: 'cowDeaths',
         },
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cow Deaths. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;
