[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:14:43
         {
             Header: 'Cow Price',
             id: 'cowPrice',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.cowPrice);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $100.00
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:22:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
                   },
         },
-        {
-            Header: 'Milk Price',
-            id: 'milkPrice',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.milkPrice);
-            },
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
-        },
+        {},
         {
             Header: 'Start Bal',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:25:43
         {
             Header: 'Milk Price',
             id: 'milkPrice',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.milkPrice);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $5.00
Received:

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:36:43
         {
             Header: 'Start Bal',
             id: 'startingBalance',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.startingBalance);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $10,000.00
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:44:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
                   },
         },
-        {
-            Header: 'Start Date',
-            id: 'startingDate',
-            accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
-
-        },
+        {},
         {
             Header: 'Leaderboard',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:46:17
         },
         {
             Header: 'Start Date',
-            id: 'startingDate',
+            id: "",
             accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
             Cell: (props) => {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-startingDate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] MethodExpression
main/components/Reports/ReportHeaderTable.js:47:43
         {
             Header: 'Start Date',
             id: 'startingDate',
-            accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
+            accessor: (row, _rowIndex) => String(row.startingDate),
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2023-08-06$/
Received:
  2023-08-06T00:00:00

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:47:23
         {
             Header: 'Start Date',
             id: 'startingDate',
-            accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
+            accessor: () => undefined,
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2023-08-06$/
Received:

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:48:30
             Header: 'Start Date',
             id: 'startingDate',
             accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
 
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:57:23
         {
             Header: 'Leaderboard',
             id: 'showLeaderboard',
-            accessor: (row, _rowIndex) => String(row.showLeaderboard), // hack needed for boolean values to show up
+            accessor: () => undefined, // hack needed for boolean values to show up
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:58:30
             Header: 'Leaderboard',
             id: 'showLeaderboard',
             accessor: (row, _rowIndex) => String(row.showLeaderboard), // hack needed for boolean values to show up
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:81:23
         },
         {
             Header: 'BelowCap',
-            accessor: 'belowCapacityHealthUpdateStrategy',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-belowCapacityHealthUpdateStrategy"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:82:30
         {
             Header: 'BelowCap',
             accessor: 'belowCapacityHealthUpdateStrategy',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:89:23
         },
         {
             Header: 'AboveCap',
-            accessor: 'aboveCapacityHealthUpdateStrategy',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-aboveCapacityHealthUpdateStrategy"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:90:30
         {
             Header: 'AboveCap',
             accessor: 'aboveCapacityHealthUpdateStrategy',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
         },
     ];
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
