[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.js:5:48
 
 // should take in a players list from a commons
 export default function ReportLineTable({ reportLines }) {
-    const USD = new Intl.NumberFormat("en-US", {
-        style: "currency",
-        currency: "USD"
-    });
+    const USD = new Intl.NumberFormat("en-US", {});
     
     const columns = [
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $9,745.00
Received:
  9,745

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:13:23
     const columns = [
         {
             Header: 'userId',
-            accessor: 'userId', 
+            accessor: "", 
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:21:23
         },
         {
             Header: 'Username',
-            accessor: 'username',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-username"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:22:30
         {
             Header: 'Username',
             accessor: 'username',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:29:17
         },
         {
             Header: 'Total Wealth',
-            id: 'totalWealth',
+            id: "",
             accessor: (row, _rowIndex) => {
                 return USD.format(row.totalWealth);
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-totalWealth"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:48:23
         },
         {
             Header: 'Avg Cow Health',
-            accessor: 'avgCowHealth',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-avgCowHealth"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.js:70:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
                   }, 
         },
-        {
-            Header: 'Cow Deaths',
-            accessor: 'cowDeaths',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  }, 
-        },
+        {},
         {
             Header: 'Create Date',
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:81:30
         {
             Header: 'Create Date',
             accessor: 'createDate',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  }, 
+            Cell: (props) => {}, 
         },
     ];
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
