[Killed] ObjectLiteral
main/components/Reports/ReportTable.js:37:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
                   },
         },
-        {
-            Header: 'Name',
-            accessor: 'name',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
-        },
+        {},
         {
             Header: 'Create Date',
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportTable.js:40:30
         {
             Header: 'Name',
             accessor: 'name',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
         },
         {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportTable.js:62:21
                   },
         },
         {
-            Header: 'Num Cows',
+            Header: "",
             accessor: 'numCows',
             Cell: (props) => {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Num Cows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m
