[Killed] StringLiteral
main/components/Commons/CommonsForm.js:29:21
 
     const {data: healthUpdateStrategies} = useBackend(
         "/api/commons/all-health-update-strategies", {
-            method: "GET",
+            method: "",
             url: "/api/commons/all-health-update-strategies",
         },
killedBy: CommonsForm tests the correct parameters are passed to useBackend
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/commons/all-health-update-strategies", {"method": "GET", "url": "/api/commons/all-health-update-strategies"}
Received
       1
          "/api/commons/all-health-update-strategies",
          Object {
        -   "method": "GET",

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:42:13
     );
 
     useEffect(() => {
-        if (defaults && !initialCommons) {
+        if (defaults || !initialCommons) {
             const {
                 startingBalance,
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot destructure property 'startingBalance' of 'defaults' as it is undefined.
