[Killed] StringLiteral
main/components/Commons/CommonsCard.js:13:46
         }>
             <Container>
                 <Row>
-                    <Col sx={4} data-testid={`${testIdPrefix}-id-${commons.id}`}>{commons.id}</Col>
+                    <Col sx={4} data-testid={``}>{commons.id}</Col>
                     <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>{commons.name}</Col>
                     {buttonText != null &&
killedBy: CommonsList tests renders without crashing when button text is set
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="/commonsCard-id/"]

<body>
  <div>
    <div
      class="my-3 border-0 card"
      style="opacity: 0.9;"
    >

[Killed] StringLiteral
main/components/Commons/CommonsCard.js:14:46
             <Container>
                 <Row>
                     <Col sx={4} data-testid={`${testIdPrefix}-id-${commons.id}`}>{commons.id}</Col>
-                    <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>{commons.name}</Col>
+                    <Col sx={4} data-testid={``}>{commons.name}</Col>
                     {buttonText != null &&
                         <Col sm={4}>
killedBy: CommonsList tests renders without crashing when button text is set
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="/commonsCard-name/"]

<body>
  <div>
    <div
      class="my-3 border-0 card"
      style="opacity: 0.9;"
    >

[Killed] EqualityOperator
main/components/Commons/CommonsCard.js:15:22
                 <Row>
                     <Col sx={4} data-testid={`${testIdPrefix}-id-${commons.id}`}>{commons.id}</Col>
                     <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>{commons.name}</Col>
-                    {buttonText != null &&
+                    {buttonText == null &&
                         <Col sm={4}>
                             <Button
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-day.png);"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.js:15:22
                 <Row>
                     <Col sx={4} data-testid={`${testIdPrefix}-id-${commons.id}`}>{commons.id}</Col>
                     <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>{commons.name}</Col>
-                    {buttonText != null &&
-                        <Col sm={4}>
-                            <Button
-                                data-testid={`${testIdPrefix}-button-${buttonText}-${commons.id}`}
-                                size="sm"
-                                className="mx-4"
-                                onClick={() => buttonLink(commons.id)} >{buttonText}
-                            </Button>
-                        </Col>
+                    {false
                     }
                 </Row>
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-day.png);"
    >
