[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:15:9
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
 
-    if (modifiedCommons.lastDate) {
+    if (true) {
         modifiedCommons.lastDate = modifiedCommons.lastDate.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
main/components/Commons/CommonsForm.js:15:35
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
 
-    if (modifiedCommons.lastDate) {
-        modifiedCommons.lastDate = modifiedCommons.lastDate.split("T")[0];
-    }
+    if (modifiedCommons.lastDate) {}
 
     // Stryker disable all
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2023-12-31)

Expected the element to have value:
  2023-12-31
Received:

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:32:9
     // Stryker restore all
 
     const {data: healthUpdateStrategies} = useBackend(
-        "/api/commons/all-health-update-strategies", {
+        "", {
             method: "GET",
             url: "/api/commons/all-health-update-strategies",
killedBy: CommonsForm tests the correct parameters are passed to useBackend
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/commons/all-health-update-strategies", {"method": "GET", "url": "/api/commons/all-health-update-strategies"}
Received
       1
          "",
          {"method": "GET", "url": "/api/commons/all-health-update-strategies"},
       2

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:41:18
     const {data: defaults} = useBackend(
         "/api/commons/defaults", {
             method: "GET",
-            url: "/api/commons/defaults",
+            url: "",
         },
     );
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null

[Killed] BlockStatement
main/components/Commons/CommonsForm.js:45:21
         },
     );
 
-    useEffect(() => {
-        if (defaults && !initialCommons) {
-            const {
-                startingBalance,
-                cowPrice,
-                milkPrice,
-                degradationRate,
-                carryingCapacity,
-                capacityPerUser,
-                aboveCapacityHealthUpdateStrategy,
-                belowCapacityHealthUpdateStrategy
-            } = defaults;
-            
-            reset({
-                startingBalance,
-                cowPrice,
-                milkPrice,
-                degradationRate,
-                carryingCapacity,
-                capacityPerUser,
-                aboveCapacityHealthUpdateStrategy,
-                belowCapacityHealthUpdateStrategy
-            });
-        }
-    }, [defaults, initialCommons, reset]);
+    useEffect(() => {}, [defaults, initialCommons, reset]);
 
     const testid = "CommonsForm";
killedBy: CommonsForm tests sets default values when defaults are available and initialCommons is not provided
statusReason: Error: expect(element).toHaveValue(5000)

Expected the element to have value:
  5000
Received:
  0

[Killed] BlockStatement
main/components/Commons/CommonsForm.js:46:42
     );
 
     useEffect(() => {
-        if (defaults && !initialCommons) {
-            const {
-                startingBalance,
-                cowPrice,
-                milkPrice,
-                degradationRate,
-                carryingCapacity,
-                capacityPerUser,
-                aboveCapacityHealthUpdateStrategy,
-                belowCapacityHealthUpdateStrategy
-            } = defaults;
-            
-            reset({
-                startingBalance,
-                cowPrice,
-                milkPrice,
-                degradationRate,
-                carryingCapacity,
-                capacityPerUser,
-                aboveCapacityHealthUpdateStrategy,
-                belowCapacityHealthUpdateStrategy
-            });
-        }
+        if (defaults && !initialCommons) {}
     }, [defaults, initialCommons, reset]);
 
killedBy: CommonsForm tests sets default values when defaults are available and initialCommons is not provided
statusReason: Error: expect(element).toHaveValue(5000)

Expected the element to have value:
  5000
Received:
  0

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:46:13
     );
 
     useEffect(() => {
-        if (defaults && !initialCommons) {
+        if (true) {
             const {
                 startingBalance,
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot destructure property 'startingBalance' of 'defaults' as it is undefined.

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:58:19
                 belowCapacityHealthUpdateStrategy
             } = defaults;
             
-            reset({
-                startingBalance,
-                cowPrice,
-                milkPrice,
-                degradationRate,
-                carryingCapacity,
-                capacityPerUser,
-                aboveCapacityHealthUpdateStrategy,
-                belowCapacityHealthUpdateStrategy
-            });
+            reset({});
         }
     }, [defaults, initialCommons, reset]);
killedBy: CommonsForm tests sets default values when defaults are available and initialCommons is not provided
statusReason: Error: expect(element).toHaveValue(5000)

Expected the element to have value:
  5000
Received:
  0

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:75:56
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const oneMonthLater = new Date(curr.getFullYear(), curr.getMonth()+1, curr.getDate()).toISOString().split('T')[0];
+    const oneMonthLater = new Date(curr.getFullYear(), curr.getMonth() - 1, curr.getDate()).toISOString().split('T')[0];
 
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-12-28)

Expected the element to have value:
  2023-12-28
Received:
  2023-10-28

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:75:111
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const oneMonthLater = new Date(curr.getFullYear(), curr.getMonth()+1, curr.getDate()).toISOString().split('T')[0];
+    const oneMonthLater = new Date(curr.getFullYear(), curr.getMonth()+1, curr.getDate()).toISOString().split("")[0];
 
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-12-28)

Expected the element to have value:
  2023-12-28
Received:

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:137:47
                                 data-testid={`${testid}-startingBalance`}
                                 type="number"
                                 step="0.01"
-                                defaultValue={defaults?.startingBalance}
+                                defaultValue={defaults.startingBalance}
                                 isInvalid={!!errors.startingBalance}
                                 {...register("startingBalance", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'startingBalance')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:138:44
                                 type="number"
                                 step="0.01"
                                 defaultValue={defaults?.startingBalance}
-                                isInvalid={!!errors.startingBalance}
+                                isInvalid={!errors.startingBalance}
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:167:47
                                 id="cowPrice"
                                 type="number"
                                 step="0.01"
-                                defaultValue={defaults?.cowPrice}
+                                defaultValue={defaults.cowPrice}
                                 isInvalid={!!errors.cowPrice}
                                 {...register("cowPrice", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:168:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={defaults?.cowPrice}
-                                isInvalid={!!errors.cowPrice}
+                                isInvalid={!errors.cowPrice}
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:197:47
                                 id="milkPrice"
                                 type="number"
                                 step="0.01"
-                                defaultValue={defaults?.milkPrice}
+                                defaultValue={defaults.milkPrice}
                                 isInvalid={!!errors.milkPrice}
                                 {...register("milkPrice", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:198:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={defaults?.milkPrice}
-                                isInvalid={!!errors.milkPrice}
+                                isInvalid={!errors.milkPrice}
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:229:47
                                 id="degradationRate"
                                 type="number"
                                 step="0.0001"
-                                defaultValue={defaults?.degradationRate}
+                                defaultValue={defaults.degradationRate}
 
                                 isInvalid={!!errors.degradationRate}
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'degradationRate')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:257:47
                                 id="carryingCapacity"
                                 type="number"
                                 step="1"
-                                defaultValue={defaults?.carryingCapacity}
+                                defaultValue={defaults.carryingCapacity}
                                 isInvalid={!!errors.carryingCapacity}
                                 {...register("carryingCapacity", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'carryingCapacity')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:258:44
                                 type="number"
                                 step="1"
                                 defaultValue={defaults?.carryingCapacity}
-                                isInvalid={!!errors.carryingCapacity}
+                                isInvalid={!errors.carryingCapacity}
                                 {...register("carryingCapacity", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:284:47
                                 id="capacityPerUser"
                                 type="number"
                                 step="1"
-                                defaultValue={defaults?.capacityPerUser}
+                                defaultValue={defaults.capacityPerUser}
                                 isInvalid={!!errors.capacityPerUser}
                                 {...register("capacityPerUser", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'capacityPerUser')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:285:45
                                 type="number"
                                 step="1"
                                 defaultValue={defaults?.capacityPerUser}
-                                isInvalid={!!errors.capacityPerUser}
+                                isInvalid={!errors.capacityPerUser}
                                 {...register("capacityPerUser", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:300:49
             </Row>
 
 
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+            <Form.Group className="mb-5" style={{}} data-testid={`${testid}-r3`}>
                 <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:324:96
                 </Form.Control.Feedback>
             </Form.Group>
 
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r4`}>
+            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={``}>
                 <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                 <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r4"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:352:39
                     <HealthUpdateStrategiesDropdown
                         formName={"aboveCapacityHealthUpdateStrategy"}
                         displayName={"When above capacity"}
-                        initialValue={defaults?.aboveCapacityHealthUpdateStrategy}
+                        initialValue={defaults.aboveCapacityHealthUpdateStrategy}
                         register={register}
                         healthUpdateStrategies={healthUpdateStrategies}
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'aboveCapacityHealthUpdateStrategy')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:362:39
                     <HealthUpdateStrategiesDropdown
                         formName={"belowCapacityHealthUpdateStrategy"}
                         displayName={"When below capacity"}
-                        initialValue={defaults?.belowCapacityHealthUpdateStrategy}
+                        initialValue={defaults.belowCapacityHealthUpdateStrategy}
                         register={register}
                         healthUpdateStrategies={healthUpdateStrategies}
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'belowCapacityHealthUpdateStrategy')
