[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:54:23
         },
         {
             Header:'Cow Price',
-            accessor: row => row.commons.cowPrice,
+            accessor: () => undefined,
             id: 'commons.cowPrice'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:57:9
             accessor: row => row.commons.cowPrice,
             id: 'commons.cowPrice'
         },
-        {
-            Header:'Milk Price',
-            accessor: row => row.commons.milkPrice,
-            id: 'commons.milkPrice'
-        },
+        {},
         {
             Header:'Starting Balance',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:59:23
         },
         {
             Header:'Milk Price',
-            accessor: row => row.commons.milkPrice,
+            accessor: () => undefined,
             id: 'commons.milkPrice'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:64:23
         },
         {
             Header:'Starting Balance',
-            accessor: row => row.commons.startingBalance,
+            accessor: () => undefined,
             id: 'commons.startingBalance'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:67:9
             accessor: row => row.commons.startingBalance,
             id: 'commons.startingBalance'
         },
-        {
-            Header:'Starting Date',
-            accessor: row => String(row.commons.startingDate).slice(0,10),
-            id: 'commons.startingDate'
-        },
+        {},
         {
             Header:'Last Date',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:68:20
             id: 'commons.startingBalance'
         },
         {
-            Header:'Starting Date',
+            Header:"",
             accessor: row => String(row.commons.startingDate).slice(0,10),
             id: 'commons.startingDate'
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Starting Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: blo

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:69:23
         },
         {
             Header:'Starting Date',
-            accessor: row => String(row.commons.startingDate).slice(0,10),
+            accessor: () => undefined,
             id: 'commons.startingDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:

[Killed] MethodExpression
main/components/Commons/CommonsTable.js:69:30
         },
         {
             Header:'Starting Date',
-            accessor: row => String(row.commons.startingDate).slice(0,10),
+            accessor: row => String(row.commons.startingDate),
             id: 'commons.startingDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:
  2022-11-22T12:34:56

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:73:20
             id: 'commons.startingDate'
         },
         {
-            Header:'Last Date',
+            Header:"",
             accessor: row => String(row.commons.lastDate).slice(0,10),
             id: 'commons.lastDate'
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:74:23
         },
         {
             Header:'Last Date',
-            accessor: row => String(row.commons.lastDate).slice(0,10),
+            accessor: () => undefined,
             id: 'commons.lastDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2024-05-03$/
Received:

[Killed] MethodExpression
main/components/Commons/CommonsTable.js:74:30
         },
         {
             Header:'Last Date',
-            accessor: row => String(row.commons.lastDate).slice(0,10),
+            accessor: row => String(row.commons.lastDate),
             id: 'commons.lastDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2024-05-03$/
Received:
  2024-05-03T15:59:59

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:79:23
         },
         {
             Header:'Degradation Rate',
-            accessor: row => row.commons.degradationRate,
+            accessor: () => undefined,
             id: 'commons.degradationRate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0.01
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:83:20
             id: 'commons.degradationRate'
         },
         {
-            Header:'Show Leaderboard?',
+            Header:"",
             id: 'commons.showLeaderboard', // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard) // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show Leaderboard?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:92:21
             accessor: 'totalCows'
         },
         {
-            Header: 'Capacity Per User',
+            Header: "",
             accessor: row => row.commons.capacityPerUser,
             id: 'commons.capacityPerUser'
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Capacity Per User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:93:23
         },
         {
             Header: 'Capacity Per User',
-            accessor: row => row.commons.capacityPerUser,
+            accessor: () => undefined,
             id: 'commons.capacityPerUser'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:97:21
             id: 'commons.capacityPerUser'
         },
         {
-            Header: 'Carrying Capacity',
+            Header: "",
             accessor: row => row.commons.carryingCapacity,
             id: 'commons.carryingCapacity'
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Carrying Capacity. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:98:23
         },
         {
             Header: 'Carrying Capacity',
-            accessor: row => row.commons.carryingCapacity,
+            accessor: () => undefined,
             id: 'commons.carryingCapacity'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:101:9
             accessor: row => row.commons.carryingCapacity,
             id: 'commons.carryingCapacity'
         },
-        {
-            Header: 'Effective Capacity',
-            accessor: 'effectiveCapacity'
-        }
+        {}
     ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:102:21
             id: 'commons.carryingCapacity'
         },
         {
-            Header: 'Effective Capacity',
+            Header: "",
             accessor: 'effectiveCapacity'
         }
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Effective Capacity. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:103:23
         },
         {
             Header: 'Effective Capacity',
-            accessor: 'effectiveCapacity'
+            accessor: ""
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-effectiveCapacity"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
