[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:14:9
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
 
-    if (modifiedCommons.lastDate) {
+    if (false) {
         modifiedCommons.lastDate = modifiedCommons.lastDate.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2023-12-31)

Expected the element to have value:
  2023-12-31
Received:

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:15:67
     }
 
     if (modifiedCommons.lastDate) {
-        modifiedCommons.lastDate = modifiedCommons.lastDate.split("T")[0];
+        modifiedCommons.lastDate = modifiedCommons.lastDate.split("")[0];
     }
 
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2023-12-31)

Expected the element to have value:
  2023-12-31
Received:
