[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:38:13
     );
 
     useEffect(() => {
-        if (defaults && !initialCommons) {
+        if (false) {
             const {
                 startingBalance,
killedBy: CommonsForm tests sets default values when defaults are available and initialCommons is not provided
statusReason: Error: expect(element).toHaveValue(5000)

Expected the element to have value:
  5000
Received:
  0

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:38:25
     );
 
     useEffect(() => {
-        if (defaults && !initialCommons) {
+        if (defaults && initialCommons) {
             const {
                 startingBalance,
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Error: expect(element).toHaveValue(1200.1)

Expected the element to have value:
  1200.1
Received:
  10000

[Killed] ArrayDeclaration
main/components/Commons/CommonsForm.js:61:8
                 belowCapacityHealthUpdateStrategy
             });
         }
-    }, [defaults, initialCommons, reset]);
+    }, []);
 
     const testid = "CommonsForm";
killedBy: CommonsForm tests sets default values when defaults are available and initialCommons is not provided
statusReason: Error: expect(element).toHaveValue(5000)

Expected the element to have value:
  5000
Received:
  0

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:69:25
     const today = curr.toISOString().split('T')[0];
     const oneMonthLater = new Date(curr.getFullYear(), curr.getMonth()+1, curr.getDate()).toISOString().split('T')[0];
 
-    const DefaultVals = {
-        name: "",
-        startingDate: today, 
-        lastDate: oneMonthLater
-    };
+    const DefaultVals = {};
 
     return (
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-11-28)

Expected the element to have value:
  2023-11-28
Received:
