[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:64:23
         },
         {
             Header: <span>Starting<br />Balance</span>,
-            accessor: row => row.commons.startingBalance,
+            accessor: () => undefined,
             id: 'commons.startingBalance'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:67:9
             accessor: row => row.commons.startingBalance,
             id: 'commons.startingBalance'
         },
-        {
-            Header: <span>Starting<br />Date</span>,
-            accessor: row => String(row.commons.startingDate),
-            id: 'commons.startingDate'
-        },
+        {},
         {
             Header:'Last Date',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:69:23
         },
         {
             Header: <span>Starting<br />Date</span>,
-            accessor: row => String(row.commons.startingDate),
+            accessor: () => undefined,
             id: 'commons.startingDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:74:23
         },
         {
             Header:'Last Date',
-            accessor: row => String(row.commons.lastDate),
+            accessor: () => undefined,
             id: 'commons.lastDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2024-05-03$/
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:93:23
         },
         {   
             Header: <span>Cap<br />Per User</span>,
-            accessor: row => row.commons.capacityPerUser,
+            accessor: () => undefined,
             id: 'commons.capacityPerUser'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:98:23
         },
         {
             Header: <span>Carrying<br />Cap</span>,
-            accessor: row => row.commons.carryingCapacity,
+            accessor: () => undefined,
             id: 'commons.carryingCapacity'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:101:9
             accessor: row => row.commons.carryingCapacity,
             id: 'commons.carryingCapacity'
         },
-        {
-            Header: <span>Effective<br />Cap</span>,
-            accessor: 'effectiveCapacity'
-        }
+        {}
     ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:103:23
         },
         {
             Header: <span>Effective<br />Cap</span>,
-            accessor: 'effectiveCapacity'
+            accessor: ""
         }
     ];
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
